[{"PartId":17,"Name":"BMW M52","Description":"Configuration: Inline-six\r\nDisplacement: 2.5L to 2.8L\r\nProduction Years: 1994-2001\r\nFeatures: The M52 engine introduced the VANOS variable valve timing system, which improved performance and fuel efficiency. It was used in various BMW models, including the E36 3 Series and E39 5 Series.","Price":15000,"CategoryId":1,"Category":null,"UserId":"1d73c20c-ee26-4e4f-b967-b993f382e6f5","User":null,"UserFavoriteParts":[],"ImageUrl":"https://www.bimmerarchive.org/images/5177-114-bmw-m52@2x.jpg"},{"PartId":18,"Name":"BMW M54","Description":"Configuration: Inline-six\r\nDisplacement: 2.2L to 3.0L\r\nProduction Years: 2000-2006\r\nFeatures: The M54 engine was an evolution of the M52 and featured an aluminum block and cylinder head. It introduced an improved version of VANOS and was equipped with advanced engine management systems. It was used in models like the E46 3 Series and E39 5 Series.","Price":13000,"CategoryId":1,"Category":null,"UserId":"1d73c20c-ee26-4e4f-b967-b993f382e6f5","User":null,"UserFavoriteParts":[],"ImageUrl":"https://i.ytimg.com/vi/4yw4_1bI63I/maxresdefault.jpg"},{"PartId":19,"Name":"BMW N54","Description":"Configuration: Inline-six\r\nDisplacement: 3.0L\r\nProduction Years: 2006-2010\r\nFeatures: The N54 engine was a turbocharged direct-injection engine that marked BMW\u0027s return to turbocharging. It offered impressive power output, with twin turbochargers and a high-pressure fuel injection system. It was used in models such as the E90/E92 3 Series and E82/E88 1 Series.","Price":17000,"CategoryId":1,"Category":null,"UserId":"1d73c20c-ee26-4e4f-b967-b993f382e6f5","User":null,"UserFavoriteParts":[],"ImageUrl":"https://images-stag.jazelc.com/uploads/theautopian-m2en/335i-engine-bay.jpg"},{"PartId":20,"Name":"S tronic (DSG) Audi","Description":"The S tronic, also known as Direct Shift Gearbox (DSG), is Audi\u0027s dual-clutch transmission technology. It combines the efficiency of a manual transmission with the convenience of an automatic transmission. It features two independent clutches for seamless and lightning-fast gear changes.\r\nNotable Models: Audi A3, A4, A5, A6, TT, and various S and RS models.","Price":19000,"CategoryId":2,"Category":null,"UserId":"4458aa45-a774-47dd-b248-467adb549b5b","User":null,"UserFavoriteParts":[],"ImageUrl":"https://static.wixstatic.com/media/c3e527_eeac5846b92f4c5a839e8f5b8a02021b~mv2.png/v1/fill/w_640,h_400,al_c,q_85,usm_4.00_1.00_0.00,enc_auto/c3e527_eeac5846b92f4c5a839e8f5b8a02021b~mv2.png"},{"PartId":21,"Name":"Tiptronic Audi","Description":"The Tiptronic transmission is a type of automatic transmission that allows manual gear shifting, either by using paddle shifters or by moving the gear lever to a separate manual shift gate. It offers the convenience of automatic shifting and the control of manual gear selection.\r\nNotable Models: Audi A4, A5, A6, A7, A8, Q5, Q7, and various S and RS models.","Price":21000,"CategoryId":2,"Category":null,"UserId":"4458aa45-a774-47dd-b248-467adb549b5b","User":null,"UserFavoriteParts":[],"ImageUrl":"https://www.audi-technology-portal.de/en/download?file=813"},{"PartId":22,"Name":"DSG (Direct Shift Gearbox) VW","Description":"The DSG, also known as Direct Shift Gearbox, is Volkswagen\u0027s dual-clutch transmission technology. It offers quick and seamless gear changes, combining the efficiency of a manual transmission with the convenience of an automatic transmission.\r\nNotable Models: Volkswagen Golf GTI, Golf R, Jetta GLI, Passat, Tiguan, and various other VW models.","Price":9000,"CategoryId":2,"Category":null,"UserId":"1d73c20c-ee26-4e4f-b967-b993f382e6f5","User":null,"UserFavoriteParts":[],"ImageUrl":"https://b1936034.smushcdn.com/1936034/wp-content/uploads/2020/01/DL382.png?lossy=1\u0026strip=1\u0026webp=1"},{"PartId":23,"Name":"6-speed Manual VW","Description":"Volkswagen also offers manual transmissions for enthusiasts who prefer more control over gear shifting. These transmissions are known for their precise and engaging driving experience.\r\nNotable Models: Volkswagen Golf, Jetta, Polo, Beetle, and various other VW models.","Price":7500,"CategoryId":2,"Category":null,"UserId":"4458aa45-a774-47dd-b248-467adb549b5b","User":null,"UserFavoriteParts":[],"ImageUrl":"https://images.hgmsites.net/hug/volkswagen_100708189_h.jpg"},{"PartId":24,"Name":"Mercedes-Benz AMG Ceramic Composite Brakes (CCB)","Description":"Description: The Mercedes-AMG Ceramic Composite Brakes (CCB) utilize carbon-ceramic discs for exceptional braking performance and heat resistance. CCB systems offer excellent fade resistance, reduced weight, and enhanced overall braking capabilities.\r\nNotable Models: Mercedes-AMG GT, Mercedes-AMG C63, Mercedes-AMG E63, Mercedes-AMG S63, and other high-performance AMG models.","Price":4500,"CategoryId":3,"Category":null,"UserId":"1d73c20c-ee26-4e4f-b967-b993f382e6f5","User":null,"UserFavoriteParts":[],"ImageUrl":"https://tro-nik.com/wp-content/uploads/2021/07/Mercedes-Benz-W167-brakes.-pic.-1.jpg"},{"PartId":25,"Name":"Mercedes-Benz AMG Performance Brakes","Description":"The AMG Performance Brakes are high-performance braking systems developed by Mercedes-AMG. They feature larger brake discs, multi-piston calipers, and advanced brake pad materials to provide improved stopping power and performance.\r\nNotable Models: Mercedes-AMG C43, Mercedes-AMG E53, Mercedes-AMG GLC43, and various other AMG models.","Price":8700,"CategoryId":3,"Category":null,"UserId":"4458aa45-a774-47dd-b248-467adb549b5b","User":null,"UserFavoriteParts":[],"ImageUrl":"https://www.kunzmann.de/image/replacement-and-wearparts-brake-equipment-brake-di-29847-xl.jpg"},{"PartId":26,"Name":"Adaptive M Suspension","Description":"Found in high-performance BMW M models, the Adaptive M Suspension combines adaptive dampers with electronically controlled shock absorbers. It offers adjustable suspension settings to optimize comfort and performance based on driving conditions and driver preferences.","Price":16000,"CategoryId":4,"Category":null,"UserId":"4458aa45-a774-47dd-b248-467adb549b5b","User":null,"UserFavoriteParts":[],"ImageUrl":"https://www.bmw.ie/en/shop/ls/images/connected-drive/xl/VDC_Offer/images/Adaptives_M_Fahrwerk_902x508.jpg"},{"PartId":27,"Name":"Audi Dynamic Ride Control (DRC)","Description":"This suspension system employs diagonally interconnected hydraulic shock absorbers. It helps reduce body roll during cornering and enhances stability by transferring oil between the shock absorbers. The result is improved handling and a smoother ride.","Price":9500,"CategoryId":4,"Category":null,"UserId":"4458aa45-a774-47dd-b248-467adb549b5b","User":null,"UserFavoriteParts":[],"ImageUrl":"https://audimediacenter-a.akamaihd.net/system/production/media/84119/images/7e6b0f01721320da20eade10395735ebf282c6a1/A1912000_x500.jpg?1582560882"},{"PartId":28,"Name":"M Sport Seats","Description":"BMW E46 Cab M Sport Dakota Coral Red Leather","Price":850,"CategoryId":5,"Category":null,"UserId":"4458aa45-a774-47dd-b248-467adb549b5b","User":null,"UserFavoriteParts":[],"ImageUrl":"https://trimtechnik.net/assets/images/content/129/bmw_e46_cab_m_sport_coral_red_leather_003__1000.jpg"},{"PartId":31,"Name":"Audi RS4 B7 Recaro Seats","Description":"These Recaro seats were made for a European-market Audi B7 RS4 manufactured between 2006 and 2008, and are upholstered in black leather with black stitching. The seller purchased the seats a year ago and had them installed in his 2007 RS4 for 10 months. The buckets are equipped with manual and powered adjusters, as well as heaters, and connectors for the latter are retained. This set is offered in Seattle, Washington with a bill of sale.The RS4 logo is embossed in the headrests, and the shoulder pads feature pass-throughs for racing harnesses.","Price":1150,"CategoryId":5,"Category":null,"UserId":"1d73c20c-ee26-4e4f-b967-b993f382e6f5","User":null,"UserFavoriteParts":[],"ImageUrl":"https://bringatrailer.com/wp-content/uploads/2019/01/1547765401b064a6f7f52ae3fPhoto-Jan-10-6-09-19-PM.jpg"},{"PartId":32,"Name":"Carbon rear wing / rear spoiler","Description":"Adjustable Carbon Fiber tuning rear wing / rear spoiler / spoiler for Mercedes C63 AMG and C63S AMG / type C205.\r\nThe angle of attack of the carbon rear wing / rear spoiler / spoiler can be adjusted in three stages (0 ° / 5 ° / 10 °) and can be adjusted to the driver\u0027s personal preferences.\r\n\r\nThe Rear Wing blade is made in prepreg technology and cured in an autoclave. In the prepreg process, the carbon fiber fabric is pre impregnated with the reactive resins and cured in the autoclave under pressure and heat. The prepreg technology ensures a homogeneous distribution of the reactive resins and ensures components of the highest quality.\r\n\r\nThe uprights or feet and the stiffeners (stiffeners are inside the trunk / not visible) are milled from aluminum and anodized in black.\r\n\r\nFor assembly, you have to drill through the outer skin of the trunk dor and the internal stiffeners are screwed between the outer and inner skin of the trunk dor. The stiffeners ensure that the rear wing is absolutely stable.\r\n","Price":600,"CategoryId":6,"Category":null,"UserId":"4458aa45-a774-47dd-b248-467adb549b5b","User":null,"UserFavoriteParts":[],"ImageUrl":"https://luethen-motorsport.com/media/image/9f/42/ed/mercedes-c63-amg-coupe-c205-carbon-heckflugel-heckspoiler-ac2051200_600x600.jpg"},{"PartId":33,"Name":"LED Angel Eyes (white)","Description":"Angel Eyes Kit /White Light/ for BMW 5 Series E60/E61 (2003-2007) Factory Angel Eyes Headlights\r\n\r\nThis model of angel eyes replaces the original, featuring five times the brightness. They are installed in place of the old factory rings and are suitable for daytime running lights.\r\n\r\nIt is recommended to purchase an additional Stop Error module to eliminate the error for a burnt bulb, due to the lower power consumption.\r\n\r\nThe set contains four LED rings.","Price":2200,"CategoryId":6,"Category":null,"UserId":"4458aa45-a774-47dd-b248-467adb549b5b","User":null,"UserFavoriteParts":[],"ImageUrl":"https://nastarta-shop.com/wp-content/uploads/2022/02/led_halo.jpg"},{"PartId":34,"Name":"LCI LED Headlights - BMW F10 M5 \u0026 5 Series","Description":"Introducing Bimmer Plug\u0027s LCI LED Headlights - BMW F10 M5 \u0026 5 Series, the perfect lighting upgrade to elevate the style and performance of your cherished BMW. Designed specifically for the F10 M5 and 5 Series models, these headlights combine innovative technology, impeccable craftsmanship, and a sleek design to enhance your driving experience.\r\n\r\nWith their striking and contemporary appearance, Bimmer Plug\u0027s LCI LED Headlights add a touch of sophistication to your BMW. The sleek lines and modern aesthetics seamlessly integrate with the existing design of your vehicle, creating a cohesive and captivating look that will turn heads on the road.\r\n\r\nThe key feature of these headlights lies in their advanced LED technology, which provides exceptional illumination. The high-quality LED bulbs produce a bright, focused beam, enhancing visibility and ensuring safety during nighttime and adverse weather conditions. Enjoy an enhanced driving experience with improved visibility and clarity, allowing you to navigate the roads confidently.\r\n\r\nBimmer Plug is committed to energy efficiency and sustainability. The LCI LED Headlights are designed with low power consumption, reducing the strain on your vehicle\u0027s electrical system. Not only does this contribute to a more eco-friendly driving experience, but it also ensures that your BMW operates at its optimal performance level.","Price":800,"CategoryId":6,"Category":null,"UserId":"1d73c20c-ee26-4e4f-b967-b993f382e6f5","User":null,"UserFavoriteParts":[],"ImageUrl":"https://bimmerplug.com/cdn/shop/products/LCI-LED-Headlights-BMW-F10-M5-5-Series-2_800x.jpg?v=1655094531"},{"PartId":35,"Name":"Soundstage \u002B Subwoofer System for BMW 3-Series","Description":"Perfect sound, perfectly engineered exactly for your BMW. Click here to learn what goes into the design \u0026 development of our Soundstage™ audio systems). Our Soundstage™\u002BSubwoofer is a complete, plug-n-play replacement audio system acoustically tailored to your 2013\u002B 3-series BMW.\r\n\r\nThe Soundstage™\u002BSubwoofer are designed to work as a complete system, or can be purchased and installed separately.\r\n\r\nWhat\u0027s Included:\r\nSoundstage™ Series 3-way Front Speaker Package\r\nCustom Crossovers with Vehicle-specific Acoustic Tuning\r\nIntegral Audio® Phantom™ Subwoofer System (PSS-F30)\r\nAmplifier by ARC Audio, Class-H delivering 75W per front channel and 250W to subwoofer\r\nSMARTConnect™ plug-n-play wiring harnesses\r\nCustom Mounting Brackets \u0026 Adapters\r\n100% Complete Kit - Everything you need - down the last screw","Price":2500,"CategoryId":7,"Category":null,"UserId":"1d73c20c-ee26-4e4f-b967-b993f382e6f5","User":null,"UserFavoriteParts":[],"ImageUrl":"https://integralaudio.com/media/catalog/product/cache/429f869d5d4fbd3e94a8a75b24ebea81/f/3/f30.soundstage.complete_2_1.jpg"},{"PartId":36,"Name":"Performance chip Audi A3 1.9 TDI 110hp","Description":"P-Tronic tuning boxes for turbo diesel engines can provide up to 30% more power and 35% more torque. They also reduce diesel consumption with equivalent driving. These benefits come with no risk to mechanical components. P-Tronic never exceeds the standards prescribed by car manufacturers and retains all the original safety features.\r\nYour Audi A3 wins 37 hp and 70 Nm\r\nWith the P-Tronic PT-A-93885 tuning box, you can exploit the full potential of the diesel 1.9 TDI 110 hp engine in your Audi A3. Its power increases to 147 hp (\u002B 34%) and its torque is boosted by 30%. All while cutting of the compact car consumption by 15%.","Price":300,"CategoryId":7,"Category":null,"UserId":"1d73c20c-ee26-4e4f-b967-b993f382e6f5","User":null,"UserFavoriteParts":[],"ImageUrl":"https://www.ptronic.com/files/images/boitiers/12/1.jpg"}]